# Name - Anirban Rana

# Batch - DS2309

# Question no 1

In [9]:
import selenium

In [1]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd 
import warnings
warnings.filterwarnings('ignore')
import time

In [26]:
driver = webdriver.Chrome()

In [27]:
driver.get('https://www.shine.com/')

In [28]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [30]:
designation = driver.find_element(By.CLASS_NAME,'searchBarInput')

designation.send_keys("Data Analyst")
designation.click()

In [32]:
title = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input')
title.send_keys("Data Analyst")

In [35]:
location = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
location.send_keys("Bangalore")

In [37]:
search = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [38]:
#scraping the job title
job_title.clear()
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tags[0:10]:
    job_title.append(i.text)

In [39]:
job_title

['Clinical Data Analyst',
 'Data Analyst 1',
 'Data Analyst Urgent Recruitment',
 'Data Analyst Urgent Recruitment',
 'Data Analyst Urgent Recruitment',
 'Clinical Data Analyst',
 'Hiring For Data Analyst',
 'Data Analyst',
 'Data Analyst',
 'Apply Now a Data Analyst']

In [58]:
#scraping job location
job_location.clear()
loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
import re
for i in loc_tags[0:10]:
    line=re.sub(r'\n\+\d+','',i.text)
    job_location.append(line.strip())

In [59]:
job_location

['Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore']

In [60]:
#scraping company name 
company_name.clear()
com_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in com_tags[0:10]:
    company_name.append(i.text)

In [61]:
company_name

['quiscon biotech',
 'merck ltd',
 'divya interprises',
 'divya interprises',
 'divya interprises',
 'techno endura',
 'divya interprises',
 'v-tech data outsourcing',
 'deuglo infosystem private limited',
 'deuglo infosystem private limited']

In [62]:
#scraping experience required
experience_required.clear()
exp_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags[0:10]:
    experience_required.append(i.text)

In [63]:
experience_required

['0 to 2 Yrs',
 '1 to 3 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 1 Yr',
 '0 to 4 Yrs',
 '0 to 2 Yrs',
 '1 to 2 Yrs',
 '1 to 2 Yrs']

In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame({'Title':job_title,'Comapany':company_name,'Location':job_location,'Experience':experience_required})

In [66]:
df

,Title,Comapany,Location,Experience
0,Clinical Data Analyst,quiscon biotech,Bangalore,0 to 2 Yrs
1,Data Analyst 1,merck ltd,Bangalore,1 to 3 Yrs
2,Data Analyst Urgent Recruitment,divya interprises,Bangalore,0 to 4 Yrs
3,Data Analyst Urgent Recruitment,divya interprises,Bangalore,0 to 4 Yrs
4,Data Analyst Urgent Recruitment,divya interprises,Bangalore,0 to 4 Yrs
5,Clinical Data Analyst,techno endura,Bangalore,0 to 1 Yr
6,Hiring For Data Analyst,divya interprises,Bangalore,0 to 4 Yrs
7,Data Analyst,v-tech data outsourcing,Bangalore,0 to 2 Yrs
8,Data Analyst,deuglo infosystem private limited,Bangalore,1 to 2 Yrs
9,Apply Now a Data Analyst,deuglo infosystem private limited,Bangalore,1 to 2 Yrs

# Question no 2

In [67]:
driver = webdriver.Chrome()

In [68]:
driver.get('https://www.shine.com/')

In [69]:
job_title = []
job_location = []
company_name = []

In [70]:
designation = driver.find_element(By.XPATH,'/html/body/div/header[2]/div[2]/div[1]/input')
designation.send_keys("Data Scientist")

In [71]:
designation.click()

In [72]:
title = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input')
title.send_keys('Data Scientist')

In [73]:
loc = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
loc.send_keys('Bangalore')

In [75]:
search = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [76]:
#scraping job title
job_title.clear()
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tags[0:10]:
    job_title.append(i.text)

In [77]:
job_title

['Data Scientist Urgent Recruitment',
 'Data Scientist- Bangalore',
 'Data Scientist AI ML CV',
 'Data Scientist AI ML NLP',
 'Phd Data Scientist',
 'Data Scientist-Bangalore',
 'Hiring For Data Scientist',
 'Data Scientist',
 'Staff Data Scientist & Team Lead',
 'Data Scientist Associate Sr - NLP']

In [80]:
#scraping job location 
job_location.clear()
loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags[0:10]:
    line=re.sub(r'\n\+\d+','',i.text)
    job_location.append(line.strip())

In [81]:
job_location

['Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore']

In [83]:
#scraping company name
company_name.clear()
name_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in name_tags[0:10]:
    company_name.append(i.text)

In [85]:
company_name

['divya interprises',
 'the fashion cosmo',
 'bosch group',
 'bosch group',
 'bosch group',
 'shiva hr services',
 'divya interprises',
 'racanaa energy solution private lim...',
 'true caller',
 'jpmorgan']

In [86]:
#creating dataframe
df = pd.DataFrame({'Title':job_title,'Company':company_name,'Location':job_location})

In [87]:
df

,Title,Company,Location
0,Data Scientist Urgent Recruitment,divya interprises,Bangalore
1,Data Scientist- Bangalore,the fashion cosmo,Bangalore
2,Data Scientist AI ML CV,bosch group,Bangalore
3,Data Scientist AI ML NLP,bosch group,Bangalore
4,Phd Data Scientist,bosch group,Bangalore
5,Data Scientist-Bangalore,shiva hr services,Bangalore
6,Hiring For Data Scientist,divya interprises,Bangalore
7,Data Scientist,racanaa energy solution private lim...,Bangalore
8,Staff Data Scientist & Team Lead,true caller,Bangalore
9,Data Scientist Associate Sr - NLP,jpmorgan,Bangalore

# Question no 3

In [88]:
driver = webdriver.Chrome()

In [89]:
driver.get('https://www.shine.com/')

In [90]:
job_title =[]
job_location=[]
company_name=[]
experience_required=[]

In [91]:
designation = driver.find_element(By.XPATH,'/html/body/div/header[2]/div[2]/div[1]/input')
designation.send_keys('Data Scientist')

In [92]:
designation.click()

In [93]:
title = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[1]/div/input')
title.send_keys('Data Scientist')

In [94]:
search = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search.click()

In [95]:
loc_filter = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div/ul/li[1]/button')
loc_filter.click()

In [96]:
loc_enter = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/div/div/ul/li[1]/input')
loc_enter.send_keys('Delhi')

In [97]:
loc_click = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/div/div/ul/li[2]/span/label')
loc_click.click()

In [98]:
sal_filter = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/ul/li[3]')
sal_filter.click()

In [99]:
sal_select = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/div/div/ul/li[3]/span/label')
sal_select.click()

In [100]:
show_result = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[4]/button[2]')
show_result.click()

In [101]:
#scraping job title
job_title.clear()
title_tags = driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tags[0:10]:
    job_title.append(i.text)

In [102]:
job_title

['Data Scientist- Delhi',
 'Data Scientist-Delhi',
 'Data Scientist- Delhi',
 'Data Scientist- Delhi',
 'Data Scientist',
 'Data Scientist',
 'Clinical Data Analyst',
 'Data Modeler',
 'Data Scientist',
 'Biostatistician']

In [105]:
#scraping job location 
job_location.clear()
loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags[0:10]:
    line = re.sub(r'\n\+\d+','',i.text)
    job_location.append(line.strip())

In [106]:
job_location

['Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi',
 'Delhi']

In [107]:
#scraping company name
company_name.clear()
name_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in name_tags[0:10]:
    company_name.append(i.text)

In [108]:
company_name

['the fashion cosmo',
 'shiva hr services',
 'the fashion cosmo',
 'the fashion cosmo',
 'acme services private limited',
 'quiscon biotech',
 'techno endura',
 'v-tech data outsourcing',
 'acme services private limited',
 'national seeds corporation limited']

In [109]:
#scraping experience required
experience_required.clear()
exp_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags[0:10]:
    experience_required.append(i.text)

In [110]:
experience_required

['0 to 3 Yrs',
 '0 to 3 Yrs',
 '0 to 3 Yrs',
 '0 to 3 Yrs',
 '3 to 5 Yrs',
 '0 to 1 Yr',
 '0 to 1 Yr',
 '0 to 2 Yrs',
 '3 to 5 Yrs',
 '1 to 6 Yrs']

In [111]:
#creating dataframe
df = pd.DataFrame({'Title':job_title,'Company':company_name,'Location':job_location,'Experience':experience_required})

In [112]:
df

,Title,Company,Location,Experience
0,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
1,Data Scientist-Delhi,shiva hr services,Delhi,0 to 3 Yrs
2,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
3,Data Scientist- Delhi,the fashion cosmo,Delhi,0 to 3 Yrs
4,Data Scientist,acme services private limited,Delhi,3 to 5 Yrs
5,Data Scientist,quiscon biotech,Delhi,0 to 1 Yr
6,Clinical Data Analyst,techno endura,Delhi,0 to 1 Yr
7,Data Modeler,v-tech data outsourcing,Delhi,0 to 2 Yrs
8,Data Scientist,acme services private limited,Delhi,3 to 5 Yrs
9,Biostatistician,national seeds corporation limited,Delhi,1 to 6 Yrs

# Question no 4

In [118]:
driver = webdriver.Chrome()

In [119]:
driver.get('https://www.flipkart.com/')

In [120]:
title = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/header/div[1]/div[2]/form/div/div/input')
title.send_keys('sunglasses')

In [123]:
title.submit()

In [124]:
brand=[]
pdescription=[]
price=[]
discount=[]

In [125]:
#scraping everything at once
brand.clear()
pdescription.clear()
price.clear()
discount.clear()
start = 0
end = 3
for page in range(start,end):
    brand_tag = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    pdesc = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    price_tag = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    discount_tag = driver.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]/span')
    for i in brand_tag[0:100]:
        brand.append(i.text)
    for i in pdesc[0:100]:
        pdescription.append(i.text)
    for i in price_tag[0:100]:
        price.append(i.text)
    for i in discount_tag[0:100]:
        discount.append(i.text)

In [134]:
len(brand),len(pdescription),len(price),len(discount)

(120, 120, 120, 120)

In [135]:
#creating dataframe
df = pd.DataFrame({'Brand':brand,'Product-Description':pdescription,'Price':price,'Discount':discount})

In [136]:
df= df.head(100)

In [137]:
df

,Brand,Product-Description,Price,Discount
0,VINCENT CHASE,UV Protection Rectangular Sunglasses (53),₹499,75% off
1,Silver Kartz,UV Protection Wayfarer Sunglasses (Free Size),₹213,85% off
2,iCopertina,UV Protection Rectangular Sunglasses (Free Size),₹199,80% off
3,Fastrack,UV Protection Wayfarer Sunglasses (58),₹549,50% off
4,Rich Club,UV Protection Retro Square Sunglasses (54),₹399,69% off
...,...,...,...,...
95,ROZZETTA CRAFT,UV Protection Aviator Sunglasses (62),₹599,76% off
96,VINCENT CHASE,UV Protection Wayfarer Sunglasses (59),₹519,74% off
97,Eyewearlabs,"Polarized, UV Protection Wayfarer Sunglasses (51)","₹1,236",65% off
98,VINCENT CHASE,"by Lenskart Polarized, UV Protection Retro Squ...",₹699,65% off
99,New Specs,UV Protection Rectangular Sunglasses (Free Size),₹158,84% off

# Question no 5

In [19]:
driver = webdriver.Chrome()

In [20]:
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART')

In [21]:
rating= []
review_summary = []
full_review = []
import time

In [23]:
rating.clear()
review_summary.clear()
full_review.clear()

start = 0
end = 10
for page in range(start,end):
    rat_tag = driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    r_sum = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    full_sum = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]/div/div')
    for i in rat_tag[0:100]:
        rating.append(i.text)
    for i in r_sum[0:100]:
        review_summary.append(i.text)
    for i in full_sum[0:100]:
        full_review.append(i.text)
    next_button = driver.find_element(By.XPATH,'//nav[@class="yFHi8N"]//a')
    next_button.click()
    time.sleep(3)

In [27]:
len(rating),len(full_review),len(review_summary)

(100, 100, 100)

In [28]:
#creating data frame
import pandas as pd
df = pd.DataFrame({'Review Title':review_summary,'Full Review':full_review,'Rating':rating})

In [29]:
df

,Review Title,Full Review,Rating
0,Best in the market!,Good Camera,5
1,Worth every penny,Feeling awesome after getting the delivery of ...,5
2,Terrific,Very very good,5
3,Classy product,Camera is awesome\nBest battery backup\nA perf...,5
4,Wonderful,This is amazing at all,5
...,...,...,...
95,Classy product,Photos super,5
96,Terrific purchase,Value for money 😍,5
97,Fabulous!,Super🔥 and good performance 👌❤️,5
98,Brilliant,Excellent Phone.,5
99,Highly recommended,Awesome Battery Life...Camera clarity is too g...,5

# Question no 6

In [143]:
driver = webdriver.Chrome()

In [144]:
driver.get('https://www.flipkart.com/')

In [145]:
title = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/header/div[1]/div[2]/form/div/div/input')
title.send_keys('sneakers')
title.submit()

In [146]:
brand =[]
pdescription=[]
price=[]

In [148]:
#scraping at once
brand.clear()
pdescription.clear()
price.clear()
start = 0
end = 3
for page in range(start,end):
    brand_tags = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    price_tags = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    pdesc = driver.find_elements(By.XPATH,'//div[@class="_2B099V"]/a')
    for i in brand_tags:
        brand.append(i.text)
    for i in price_tags:
        price.append(i.text)
    for i in pdesc:
        pdescription.append(i.text)

In [156]:
g = pdescription[::2]

In [158]:
len(g)

120

In [159]:
#creating data frame
df = pd.DataFrame({'Brand':brand,'Product-Descrition':g,'Price':price})

In [161]:
df=df.head(100)

In [162]:
df

              Brand                                 Product-Descrition   Price
0              ATOM                    Alpha Predator Sneakers For Men  ₹1,389
1             kerzl  KERZL SMARTY CASUAL RUNNING SNEAKER SHOES FOR ...    ₹599
2          URBANBOX  Trending Stylish Casual Outdoor Sneakers Shoes...    ₹299
3            Layasa                                   Sneakers For Men    ₹299
4              aadi  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹349
..              ...                                                ...     ...
95  U.S. POLO ASSN.                           CLARKIN Sneakers For Men  ₹1,824
96             ATOM                       Multi Print Sneakers For Men  ₹1,349
97         Aqualite  Running Shoes,Sports Shoes for Women|Memory Fo...    ₹699
98           Labbin  Casual Sneakers ColourFul Block Shoes For Boys...    ₹649
99             aadi                                   Sneakers For Men    ₹399

[100 rows x 3 columns]

# Question no 7

In [3]:
driver = webdriver.Chrome()

In [4]:
driver.get('https://www.amazon.in/')

In [5]:
title = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input')
title.send_keys('Laptop')

In [6]:
search = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
search.click()

In [7]:
title = []
rating=[]
price =[]

In [8]:
filter_cpu = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[7]/ul[6]/span[9]/li/span/a/span')
filter_cpu.click()

In [27]:
#scraping everything at once
rating.clear()
price.clear()
title.clear()
title_tags = driver.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]')
price_tags = driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
rating_tag = driver.find_elements(By.XPATH,'//span[@class="a-icon-alt"]')
count_tag = driver.find_elements(By.XPATH,'//span[@class="a-size-base s-underline-text"]')
for i in title_tags[0:10]:
    title.append(i.text)
for i in price_tags[0:10]:
    price.append(i.text)
for ratings,counts in zip(rating_tag[0:10],count_tag[0:10]):
    rating.append((ratings.text,counts.text))

In [30]:
# important - I am not allowed to scrap reviews and rating by robots.text so I just extracted no of ratings(how many people rated)

In [29]:
import pandas as pd

In [31]:
df= pd.DataFrame({'Laptop Name':title,'Price':price,'Rating':rating})

In [32]:
df

                                         Laptop Name     Price   Rating
0  ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...    68,990   (, 39)
1  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...    49,990   (, 17)
2  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...    63,990   (, 18)
3  MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...    57,990  (, 143)
4  ASUS Vivobook 15, IntelCore i7-12650H 12th Gen...    60,990  (, 322)
5  Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 1...    62,000   (, 53)
6  MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...    64,990   (, 93)
7  Acer Predator Helios Neo 16 Gaming Laptop 13th...  1,09,990  (, 112)
8  Acer Aspire Lite Premium Metal Laptop 11th Gen...    47,990  (, 152)
9  Dell Inspiron 5430 Laptop, Intel Core i7-1360P...    84,990   (, 45)

In [33]:
# important - I am not allowed to scrap reviews and rating by robots.text so I just extracted no of ratings(how many people rated)

# Question no 8

In [34]:
driver = webdriver.Chrome()

In [35]:
driver.get('https://www.azquotes.com/')

In [36]:
top_quotes = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
top_quotes.click()

In [38]:
quote = []
authors =[]
type_ = []
import time

In [40]:
quote.clear()
authors.clear()
type_.clear()
start= 0
end = 10
for page in range(start,end):
    quote_tags = driver.find_elements(By.XPATH,'//a[@class="title"]')
    author_tag = driver.find_elements(By.XPATH,'//div[@class="author"]/a')
    type_tag = driver.find_elements(By.XPATH,'//div[@class="tags"]//a')
    for i in quote_tags[0:1000]:
        quote.append(i.text)
    for i in author_tag[0:1000]:
        authors.append(i.text)
    for i in type_tag[0:1000]:
        type_.append(i.text)
    next_button = driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[4]/li[12]/a')
    next_button.click()
    time.sleep(3)

In [50]:
values = [type_[i:i+3] for i in range(0,len(type_),3)]

In [52]:
#values

In [53]:
#creating dataframe
pd = pd.DataFrame({'Quote':quote,'Author':authors,'Type':values})

In [54]:
pd

,Quote,Author,Type
0,The essence of strategy is choosing what not t...,Michael Porter,"[Essence, Deep Thought, Transcendentalism]"
1,One cannot and must not try to erase the past ...,Golda Meir,"[Inspiration, Past, Trying]"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"[Country, Peace, War]"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"[Inspirational, Motivational, Death]"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"[4th Of July, Food, Patriotic]"
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,"[Love, Inspirational, Motivational]"
996,America... just a nation of two hundred millio...,Hunter S. Thompson,"[Gun, Two, Qualms About]"
997,For every disciplined effort there is a multip...,Jim Rohn,"[Inspirational, Greatness, Best Effort]"
998,"The spiritual journey is individual, highly pe...",Ram Dass,"[Spiritual, Truth, Yoga]"
999,The mind is not a vessel to be filled but a fi...,Plutarch,"[Inspirational, Leadership, Education]"

# Question no 9

In [61]:
driver = webdriver.Chrome()

In [62]:
driver.get('https://www.jagranjosh.com/')

In [63]:
name=[]
b_d=[]
duration=[]
remarks=[]

In [64]:
gk = driver.find_element(By.XPATH,'/html/body/div[1]/header/nav/div/div/div[3]/ul/li[6]/a')
gk.click()

In [65]:
list_pm = driver.find_element(By.XPATH,'/html/body/div[2]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
list_pm.click()

In [91]:
name.clear()
b_d.clear()
duration.clear()
remarks.clear()
name_tags = driver.find_elements(By.XPATH,'//p')
for i in name_tags:
    name.append(i.text)

In [128]:
names = [name[i+1:i+6] for i in range(13,len(name)-8,6)]

In [129]:
names

[['Jawahar Lal Nehru',
  '(1889–1964)',
  '15 August 1947 to 27 May 1964',
  '16 years, 286 days',
  'The first prime minister of India and the longest-serving PM of India, the first to die in office.'],
 ['Gulzarilal Nanda (Acting)',
  '(1898-1998)',
  '27 May 1964 to 9 June 1964,',
  '13 days',
  'First acting PM of India'],
 ['Lal Bahadur Shastri',
  '(1904–1966)',
  '9 June 1964 to 11 January 1966',
  '1 year, 216 days',
  "He has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965"],
 ['Gulzari Lal Nanda  (Acting)',
  '(1898-1998)',
  '11 January 1966 to 24 January 1966',
  '13 days',
  '-'],
 ['Indira Gandhi',
  '(1917–1984)',
  '24 January 1966 to 24 March 1977',
  '11 years, 59 days',
  'First female Prime Minister of India'],
 ['Morarji Desai',
  '(1896–1995)',
  '24 March 1977 to  28 July 1979 ',
  '2 year, 126 days',
  'Oldest to become PM (81 years old) and first to resign from office'],
 ['Charan Singh',
  '(1902–1987)',
  '28 July 1979 to 14 January 1980',
  '170 days',
  'Only PM who did not face the Parliament'],
 ['Indira Gandhi',
  '(1917–1984)',
  '14 January 1980 to 31 October 1984',
  '4 years, 291 days',
  'The first lady who served as PM for the second term'],
 ['Rajiv Gandhi',
  '(1944–1991)',
  '31 October 1984 to 2 December 1989',
  '5 years, 32 days',
  'Youngest to become PM (40 years old)'],
 ['V. P. Singh',
  '(1931–2008)',
  '2 December 1989 to 10 November 1990',
  '343 days',
  'First PM to step down after a vote of no confidence'],
 ['Chandra Shekhar',
  '(1927–2007)',
  '10 November 1990 to 21 June 1991',
  '223 days',
  'He belongs to  Samajwadi Janata Party'],
 ['P. V. Narasimha Rao',
  '(1921–2004)',
  '21 June 1991 to 16 May 1996',
  '4 years, 330 days',
  'First PM from South India'],
 ['Atal Bihari Vajpayee',
  '(1924- 2018)',
  '16 May 1996 to 1 June 1996',
  '16 days',
  'PM for shortest tenure'],
 ['H. D. Deve Gowda',
  '(born 1933)',
  '1 June 1996 to 21 April 1997',
  '324 days',
  'He belongs to  Janata Dal'],
 ['Inder Kumar Gujral',
  '(1919–2012)',
  '21 April 1997 to 19 March 1998 ',
  '332 days',
  '------'],
 ['Atal Bihari Vajpayee',
  '(1924-2018)',
  '19 March 1998 to 22 May 2004 ',
  '6 years, 64 days',
  ' The first non-congress PM who completed a full term as PM'],
 ['Manmohan Singh',
  '(born 1932)',
  '22 May 2004 to 26 May 2014   ',
  '10 years, 4 days',
  ' First Sikh PM'],
 ['Narendra Modi',
  '(born 1950)',
  '26 May 2014 - 2019',
  '4th Prime Minister of India who served two consecutive tenures',
  '19.']]

In [141]:
import pandas as pd
df = pd.DataFrame(names,columns= ['Name','Born-Dead',
'Term of office','Duration','Remarks'])

In [26]:
#df

In [143]:
df = df.drop(df.index[-1])

In [155]:
#df

In [149]:
df = df.append({'Name':'Narendra Modi','Born-Dead':'(born 1950)','Term of office':'26 May 2014 - 2019','Duration':'NaN', 'Remarks':'4th Prime Minister of India who served two consecutive tenures'},ignore_index = True)

In [153]:
df = df.append({'Name':'Narendra Modi','Born-Dead':'(born 1950)','Term of office':'30 May 2019- Incumbent','Duration':'NaN', 'Remarks':'First non-congress PM with two consecutive tenures'},ignore_index = True)

In [154]:
df

,Name,Born-Dead,Term of office,Duration,Remarks
0,Jawahar Lal Nehru,(1889–1964),15 August 1947 to 27 May 1964,"16 years, 286 days",The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,",13 days,First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),9 June 1964 to 11 January 1966,"1 year, 216 days",He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966,13 days,-
4,Indira Gandhi,(1917–1984),24 January 1966 to 24 March 1977,"11 years, 59 days",First female Prime Minister of India
5,Morarji Desai,(1896–1995),24 March 1977 to 28 July 1979,"2 year, 126 days",Oldest to become PM (81 years old) and first t...
6,Charan Singh,(1902–1987),28 July 1979 to 14 January 1980,170 days,Only PM who did not face the Parliament
7,Indira Gandhi,(1917–1984),14 January 1980 to 31 October 1984,"4 years, 291 days",The first lady who served as PM for the second...
8,Rajiv Gandhi,(1944–1991),31 October 1984 to 2 December 1989,"5 years, 32 days",Youngest to become PM (40 years old)
9,V. P. Singh,(1931–2008),2 December 1989 to 10 November 1990,343 days,First PM to step down after a vote of no confi...
10,Chandra Shekhar,(1927–2007),10 November 1990 to 21 June 1991,223 days,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,(1921–2004),21 June 1991 to 16 May 1996,"4 years, 330 days",First PM from South India
12,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996,16 days,PM for shortest tenure
13,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997,324 days,He belongs to Janata Dal
14,Inder Kumar Gujral,(1919–2012),21 April 1997 to 19 March 1998,332 days,------
15,Atal Bihari Vajpayee,(1924-2018),19 March 1998 to 22 May 2004,"6 years, 64 days",The first non-congress PM who completed a ful...
16,Manmohan Singh,(born 1932),22 May 2004 to 26 May 2014,"10 years, 4 days",First Sikh PM
17,Narendra Modi,(born 1950),26 May 2014 - 2019,NaN,4th Prime Minister of India who served two con...
18,Narendra Modi,(born 1950),30 May 2019- Incumbent,NaN,First non-congress PM with two consecutive ten...

# Question no 10

In [1]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd 
import warnings
warnings.filterwarnings('ignore')
import time
import pandas as pd

In [2]:
driver = webdriver.Chrome()

In [3]:
driver.get('https://www.motor1.com/')

In [4]:
designation = driver.find_element(By.XPATH,'/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/input')
designation.send_keys('50 most expensive cars')

In [5]:
designation.submit()

In [6]:
search = driver.find_element(By.XPATH,'/html/body/div[10]/div[6]/form/input[2]')
search.click()

In [7]:
tap = driver.find_element(By.XPATH,'/html/body/div[10]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
tap.click()

In [17]:
car_name =[]
price = []
import re

In [19]:
car_name.clear()
price.clear()
name_tags = driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
price_tags = driver.find_elements(By.XPATH,'//p/strong')
for i in name_tags[0:50]:
    car_name.append(i.text)
for i in price_tags:
    line = re.sub(r'Price: ','',i.text)
    price.append(line)

In [23]:
len(car_name)

50

In [22]:
len(price)

50

In [36]:
df = pd.DataFrame({'Car Name':car_name,'Price':price})

In [40]:
#df

In [38]:
df = df[::-1]

In [39]:
df

                              Car Name                 Price
49  Rolls-Royce La Rose Noire Droptail    $30 Million (est.)
48              Rolls-Royce Boat Tail*  $28.0 Million (est.)
47            Bugatti La Voiture Noire         $13.4 Million
46                Rolls-Royce Sweptail         $12.8 Million
45             Bugatti Chiron Profilée         $10.8 Million
44                  Bugatti Centodieci          $9.0 Million
43            Mercedes-Maybach Exelero          $8.0 Million
42                        777 Hypercar          $7.5 Million
41                    Pagani Codalunga          $7.4 Million
40                 SP Automotive Chaos          $6.4 Million
39                        Bugatti Divo          $5.8 Million
38                 Pagani Huayra Imola          $5.4 Million
37                     Bugatti Mistral          $5.0 Million
36           Pininfarina B95 Speedster          $4.8 Million
35                      Bugatti Bolide          $4.7 Million
34                  Lamborghini Veneno          $4.5 Million
33     Bugatti Chiron Super Sport 300+          $3.9 Million
32                    Koenigsegg CC850          $3.7 Million
31                    Lamborghini Sian          $3.6 million
30                       McLaren Solus          $3.5 Million
29           W Motors Lykan Hypersport          $3.4 Million
28               Aston Martin Valkyrie          $3.2 Million
27                    Koenigsegg Jesko          $3.0 Million
26         Hennessey Venom F5 Roadster          $3.0 Million
25                 Aston Martin Victor          $3.0 Million
24                        Zenvo Aurora          $2.8 Million
23            Mercedes-AMG Project One          $2.7 Million
22                Lamborghini Countach          $2.6 Million
21                  Gordon Murray T.50          $2.6 Million
20                Pininfarina Battista          $2.5 Million
19                       Pagani Utopia          $2.5 Million
18                        Rimac Nevera          $2.4 Million
17                   McLaren Speedtail          $2.3 Million
16                 Ferrari Daytona SP3          $2.3 Million
15                          Delage D12          $2.3 Million
14                 Aston Martin Vulcan          $2.3 Million
13                         Lotus Evija          $2.1 Million
12                         SSC Tuatara          $2.0 Million
11                        Deus Vayanne          $2.0 Million
10              Bentley Mulliner Batur          $2.0 Million
9        Hispano Suiza Carmen Boulogne          $1.9 Million
8                      Bentley Bacalar          $1.9 Million
7                   Hennessey Venom F5          $1.8 Million
6                          Zenvo TSR-S          $1.7 Million
5                    Koenigsegg Gemera          $1.7 Million
4                   Gordon Murray T.33          $1.7 Million
3                        Ferrari Monza          $1.7 Million
2                          Czinger 21C          $1.7 Million
1                         McLaren Elva          $1.7 Million
0                  Aston Martin Valour          $1.5 Million